<a href="https://colab.research.google.com/github/SMeghanaa/DATA-SCIENCE/blob/master/Assignment11(8_06_2020).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

Question 1:
Experiment pivot_table() function on given DataFrame

DataFrame:

df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo", "bar", "bar", "bar", "bar"],
                  	       "B": ["one", "one", "one", "two", "two", "one", "one", "two", "two"],
                   	        "C": ["small", "large", "large", "small","small", "large", "small", "small","large"],
                               "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                               "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})

In [0]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo", "bar", "bar", "bar", "bar"],
                  	       "B": ["one", "one", "one", "two", "two", "one", "one", "two", "two"],
                   	        "C": ["small", "large", "large", "small","small", "large", "small", "small","large"],
                               "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                               "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})

In [0]:
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [0]:
table = pd.pivot_table(df, values='D', index=['A', 'B'],columns=['C'], aggfunc=np.sum)
table

C        large  small
A   B
bar one    4.0    5.0
    two    7.0    6.0
foo one    4.0    1.0
    two    NaN    6.0

In [0]:
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],aggfunc={'D': np.mean,'E': np.mean})
table

                  D         E
A   C
bar large  5.500000  7.500000
    small  5.500000  8.500000
foo large  2.000000  4.500000
    small  2.333333  4.333333

#### Question 2:
Experiment How to store a pandas DataFrame as csv file

In [0]:
import pandas as pd
timetable = { 'Day' : ['Mon','Tues','Wed','Thurs','Fri', 'Sat'],
            'Classes' : [4, 5, 6, 3, 3, 2],
            'Free_periods' : [3, 4, 5, 6, 1, 2]}
df = pd.DataFrame(timetable)
df.to_csv('time-table.csv')

In [0]:
df1=pd.read_csv("time-table.csv")
df1

   Unnamed: 0    Day  Classes  Free_periods
0           0    Mon        4             3
1           1   Tues        5             4
2           2    Wed        6             5
3           3  Thurs        3             6
4           4    Fri        3             1
5           5    Sat        2             2

####Question 3:
- For IPL_2018 and IPL_2017 DataFrame finds the sum of both DataFrames and store the result in the DataFrame with the name Total.
- Creating a new column to Total DataFrame - 'Win Percentage' and values of that column will be matches won/matches played.
- Sort the teams with the most number of wins.If the number of wins of two teams are the same, sort by the win percentage

In [0]:
df18 = pd.DataFrame({'IPL-Team': ['CSK', 'SRH', 'KKR', 'RR', 'MI', 'RCB', 'KXIP', 'DD'],
                         'Matches-Played': [16, 17, 16, 15, 14, 14, 14, 14],'Matches-Won': [11, 10, 9, 7, 6, 6, 6, 5]})
df18.set_index('IPL-Team', inplace = True)
df18

          Matches-Played  Matches-Won
IPL-Team
CSK                   16           11
SRH                   17           10
KKR                   16            9
RR                    15            7
MI                    14            6
RCB                   14            6
KXIP                  14            6
DD                    14            5

In [0]:
df17 = pd.DataFrame({'IPL-Team': ['MI', 'RPS', 'KKR', 'SRH', 'KXIP', 'DD', 'GL', 'RCB'],
                         'Matches-Played': [17, 16, 16, 15, 14, 14, 14, 14],
                         'Matches-Won': [12, 10, 9, 8, 7, 6, 4, 3]})
df17.set_index('IPL-Team', inplace = True)
df17

          Matches-Played  Matches-Won
IPL-Team
MI                    17           12
RPS                   16           10
KKR                   16            9
SRH                   15            8
KXIP                  14            7
DD                    14            6
GL                    14            4
RCB                   14            3

In [0]:
total=pd.DataFrame(df17.add(df18,fill_value=0))
total

          Matches-Played  Matches-Won
IPL-Team
CSK                 16.0         11.0
DD                  28.0         11.0
GL                  14.0          4.0
KKR                 32.0         18.0
KXIP                28.0         13.0
MI                  31.0         18.0
RCB                 28.0          9.0
RPS                 16.0         10.0
RR                  15.0          7.0
SRH                 32.0         18.0

In [0]:
total["Win %"] = total['Matches-Played'].div(total['Matches-Won']).round(2)
total

          Matches-Played  Matches-Won  Win %
IPL-Team
CSK                 16.0         11.0   1.45
DD                  28.0         11.0   2.55
GL                  14.0          4.0   3.50
KKR                 32.0         18.0   1.78
KXIP                28.0         13.0   2.15
MI                  31.0         18.0   1.72
RCB                 28.0          9.0   3.11
RPS                 16.0         10.0   1.60
RR                  15.0          7.0   2.14
SRH                 32.0         18.0   1.78